{"title":"Spec Spec","nextUid":15,"features":[{"uid":0,"name":"Load everything on start","description":"When Sublime Text opens, load spec.json and resources.json into memory as JSON objects."},{"uid":1,"name":"Show Resources Command","description":"A user can run a Sublime Text command to \"mark\" a file with all of the feature links from resources.json."},{"uid":2,"name":"Hide Resources Command","description":"A user can run a Sublime Text command to hide the \"marks\" added by the \"Show Resources\" command if they exist."},{"uid":3,"name":"Save resources.json on save","description":"When the user saves a file in Sublime Text, the resources.json file is written, taking into account the changes made to the file or files that were just saved."},{"uid":4,"name":"Features at Selection Command","description":"A user can run a Sublime Text command to see all of the features associated with their current cursor locations or selections."},{"uid":5,"name":"Assign Resource Command","description":"A user can run a Sublime Text command to assign a selection of text to a particular resource."},{"uid":6,"name":"Dissociate Resource Command","description":"A user can run a Sublime Text command to remove a feature link given their current cursor position or selections. When multiple feature links are associated, the user can select which one."},{"uid":7,"name":"Spec Scope Command","description":"A user can run a Sublime Text command to see the unaddressed features and unassociated resources with the current spec and resources."},{"uid":8,"name":"Diff Scope Command","description":"A user can run a Sublime Text command to see the scope of a change made to a spec."},{"uid":9,"name":"Reload Spec Command","description":"A user can run a Sublime Text command to repopulate global plugin data with a reloaded version of spec.json."},{"uid":10,"name":"Resources for Feature Command","description":"A user can run a Sublime Text command to select a feature and then view the text of all the associated resources."},{"uid":12,"name":"Peek File on Line Command","description":"A user can run a Sublime Text command to insert a slice of a file into the current buffer. The cursor must be on a line that is just a file hook, and the file slice will be inserted directly below the hook."},{"uid":13,"name":"Hide File Slice Command","description":"A user can run a Sublime Text command to erase the file slice added by the \"Peek File on Line\" command. This command should return the buffer to the state it had before the \"Peek\" command was run."},{"uid":14,"name":"Open File on Line Command","description":"A user can run a Sublime Text command to open a file in a new view. The cursor must be on a line that contains just a file hook."}]}